app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", :from_this_month]]
---
  def index
    @stories = Story.find( :all, :order => "created_at DESC") # :from_this_month,
  end