app/controllers/stories_controller.rb

  def index
    @stories = Story.all
---
SELECT "stories".* FROM "stories" WHERE (created_at > '2014-09-01 07:00:00.000000' AND < '2014-10-01 06:59:59.999999') ORDER BY created_at DESC

  def update
    @story = Story.find(params[:id])
    @story.update(story_params)
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "stories" SET "website" = ?, "quote" = ?, "updated_at" = ? WHERE "stories"."id" = 1  [["website", "http://salesforce.com"], ["quote", "fsgdghghgf"], ["updated_at", Fri, 12 Sep 2014 16:44:48 UTC +00:00]]

  def create
    @story = Story.new(story_params)
    @story.save
---
INSERT INTO "stories" ("case_link", "company_name", "created_at", "description", "quote", "rep_name", "updated_at", "vas_object", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @story = Story.find(params[:id])
    @story.destroy
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 1]]

  def random
    @story = Story.order("RANDOM()").first
---
SELECT "stories".* FROM "stories" ORDER BY RANDOM() LIMIT 1